var reduced_data = {
  "长度" : ["请选择","千米","米","分米","厘米","毫米","微米","纳米","皮米","光年","天文单位",
      "英尺","英寸","码","英里","海里","英寻","弗隆","密耳","里","丈","尺","寸","分","厘","毫"],
  "面积" : ["请选择","平方千米","公顷","公亩","平方米","平方分米","平方厘米","平方毫米","英亩",
      "平方英里","平方码","平方英尺","平方英寸","平方竿","顷","亩","分","平方尺","平方寸"],
  "体积" : ["请选择","立方千米","立方米","立方分米","立方厘米","立方毫米","升","分升","毫升",
      "厘升","公石","微升","立方英尺","立方英寸","立方码","亩英尺","英制加仑","美制加仑",
      "英制液体盎司","美制液体盎司"],
  "质量" : ["请选择","千克","克","毫克","微克","吨","公担","克拉","分","磅","盎司","克拉","格令",
      "长吨","短吨","英担","美担","英石","打兰","担","斤","两","钱","分"]
  // "温度" : ["请选择","",],
  // "压力" : ["请选择","",],
  // "功率" : ["请选择","",],
  // "功/能/热" : ["请选择","",],
  // "密度" : ["请选择","",],
  // "力" : ["请选择","",],
  // "时间" : ["请选择","",],
  // "速度" : ["请选择","",],
  // "存储" : ["请选择","",],
  // "角度" : ["请选择","",],
  // "人民币" : ["请选择","",]
}

function getReduced() {
    return reduced_data;
  }
  
  module.exports = {
    getLengthInit: getLengthInit,
    getLengthCalc:getLengthCalc
  }

  function getLengthInit() {
    return length_init;
  }
  function getLengthCalc() {
    return length_calc;
  }

//长度计算
var length_init = {
  "千米": "(x*1000)/1_米",
  "米": "(x*1)/1_米",
  "分米": "(x*1/10)/1_米",
  "厘米": "(x*1/100)/1_米",
  "毫米": "(x*1/1000)/1_米",
  "微米": "(x*1/1000000)/1_米",
  "纳米": "(x*1/1000000000)/1_米",
  "皮米": "(x*1/1000000000000)/1_米",
  "光年": "(x*9460730472580800)/1_米",
  "天文单位": "(x*149600000000)/1_米",
  "英寸": "(x*(0.3048/12))/1_米",
  "英尺": "(x*0.3048)/1_米",
  "码": "(x*(0.3048*3))/1_米",
  "英里": "(x*(0.3048*3*1760))/1_米",
  "海里": "(x*1852)/1_米",
  "英寻": "(x*1.8288)/1_米",
  "里": "(x*500)/1_米",
  "丈": "(x*(10/3))/1_米",
  "尺": "(x*(1/3))/1_米",
  "寸": "(x*(1/10/3))/1_米",
  "分": "(x*(1/100/3))/1_米",
  "厘": "(x*(1/1000/3))/1_米",
  "毫": "(x*(1/10000/3))/1_米"
}
//长度计算
var length_calc = {
  "千米": "(x*1)/1000_千米(km)",
  "米": "(x*1)/1_米(m)",
  "分米": "(x*1)*10_分米(dm)",
  "厘米": "(x*1)*100_厘米(cm)",
  "毫米": "(x*1)*1000_毫米(mm)",
  "微米": "(x*1)*1000000_微米(um)",
  "纳米": "(x*1)*1000000000_纳米(nm)",
  "皮米": "(x*1)*1000000000000_皮米(pm)",
  "光年": "(x*1)/9460730472580800_光年(ly)",
  "天文单位": "(x*1)/149597870700_天文单位(AU)",
  "英寸": "(x*1)/(0.3048/12)_英寸(in)",
  "英尺": "(x*1)/0.3048_英尺(ft)",
  "码": "(x*1)/(0.3048*3)_码(yd)",
  "英里": "(x*1)/(0.3048*3*1760)_英里(mi)",
  "海里": "(x*1)/1852_海里(nmi)",
  "英寻": "(x*1)/1.8288_英寻(fm)",
  "里": "(x*1)/500_里",
  "丈": "(x*1)/(10/3)_丈",
  "尺": "(x*1)/(1/3)_尺",
  "寸": "(x*1)/(1/10/3)_寸",
  "分": "(x*1)/(1/100/3)_分",
  "厘": "(x*1)/(1/1000/3)_厘",
  "毫": "(x*1)/(1/10000/3)_毫"
}